{"time":1397340139,"flags":{"allow-cross-origin-auth-prompt":{"original":"kAllowCrossOriginAuthPrompt","comment":"Allows third-party content included on a page to prompt for a HTTP basic  auth username\/password pair.","condition":null,"new":false},"allow-file-access":{"original":"kAllowFileAccess","comment":"On ChromeOS, file: access is disabled except for certain whitelisted  directories. This switch re-enables file: for testing.","condition":null,"new":false},"allow-http-screen-capture":{"original":"kAllowHttpScreenCapture","comment":"Allow non-secure origins to use the screen capture API and the desktopCapture  extension API.","condition":null,"new":false},"allow-nacl-crxfs-api":{"original":"kAllowNaClCrxFsAPI","comment":"Specifies comma-separated list of extension ids or hosts to grant  access to CRX file system APIs.","condition":null,"new":false},"allow-nacl-file-handle-api":{"original":"kAllowNaClFileHandleAPI","comment":"Specifies comma-separated list of extension ids or hosts to grant  access to file handle APIs.","condition":null,"new":false},"allow-nacl-socket-api":{"original":"kAllowNaClSocketAPI","comment":"Specifies comma-separated list of extension ids or hosts to grant  access to TCP\/UDP socket APIs.","condition":null,"new":false},"allow-outdated-plugins":{"original":"kAllowOutdatedPlugins","comment":"Don&#39;t block outdated plugins.","condition":null,"new":false},"allow-running-insecure-content":{"original":"kAllowRunningInsecureContent","comment":"By default, an https page cannot run JavaScript, CSS or plug-ins from http  URLs. This provides an override to get the old insecure behavior.","condition":null,"new":false},"always-authorize-plugins":{"original":"kAlwaysAuthorizePlugins","comment":"Prevents Chrome from requiring authorization to run certain widely installed  but less commonly used plug-ins.","condition":null,"new":false},"app-id":{"original":"kAppId","comment":"Specifies that the extension-app with the specified id should be launched  according to its configuration.","condition":null,"new":false},"app":{"original":"kApp","comment":"Specifies that the associated value should be launched in \"application\"  mode.","condition":null,"new":false},"app-list-start-page-url":{"original":"kAppListStartPageURL","comment":"Specifies an URL to use for app list start page.","condition":null,"new":false},"apps-checkout-url":{"original":"kAppsCheckoutURL","comment":"Overrides the apps checkout URL, which is used to determine when to expose  some private APIs.","condition":null,"new":false},"apps-gallery-download-url":{"original":"kAppsGalleryDownloadURL","comment":"The URL that the webstore APIs download extensions from.  Note: the URL must contain one &#39;%s&#39; for the extension ID.","condition":null,"new":false},"apps-gallery-url":{"original":"kAppsGalleryURL","comment":"A setting to cause extension\/app installs from the webstore skip the normal  confirmation dialog. A value of &#39;accept&#39; means to always act as if the dialog  was accepted, and &#39;cancel&#39; means to always act as if the dialog was  cancelled.  TODO (rdevlin.cronin): Remove this.  This is not a good use of a command-line flag, as it would be equally  effective as a global boolean. Additionally, this opens up a dangerous way  for attackers to append a commandline flag and circumvent all user action for  installing an extension.  The URL to use for the gallery link in the app launcher.","condition":null,"new":false},"apps-gallery-update-url":{"original":"kAppsGalleryUpdateURL","comment":"The update url used by gallery\/webstore extensions.","condition":null,"new":false},"app-mode-auth-code":{"original":"kAppModeAuthCode","comment":"Value of GAIA auth code for --force-app-mode.","condition":null,"new":false},"app-mode-oauth-token":{"original":"kAppModeOAuth2Token","comment":"Value of OAuth2 refresh token for --force-app-mode.","condition":null,"new":false},"apps-new-install-bubble":{"original":"kAppsNewInstallBubble","comment":"Whether to always use the new app install bubble when installing an app.","condition":null,"new":false},"apps-use-native-frame":{"original":"kAppsUseNativeFrame","comment":"Experimental native frame support for packaged apps.","condition":null,"new":false},"auth-ext-path":{"original":"kAuthExtensionPath","comment":"Enables overriding the path for the default authentication extension.","condition":null,"new":false},"auth-schemes":{"original":"kAuthSchemes","comment":"Whitelist of servers that Negotiate will generate delegated Kerberos tickets  for.  HTTP authentication schemes to enable. This is a comma-separated list of  authentication schemes (basic, digest, ntlm, and negotiate). By default all  schemes are enabled. The primary use of this command line flag is to help  triage authentication-related issues reported by end-users.","condition":null,"new":false},"auth-server-whitelist":{"original":"kAuthServerWhitelist","comment":"Whitelist of servers which NTLM and Negotiate can automatically authenticate  with using the default credentials of the currently logged in user.","condition":null,"new":false},"auto-launch-at-startup":{"original":"kAutoLaunchAtStartup","comment":"A flag that is used to tell Chrome that it was launched automatically at  computer startup and not by some user action.","condition":null,"new":false},"check-for-update-interval":{"original":"kCheckForUpdateIntervalSec","comment":"Certificate Transparency: Uses the provided log(s) for checking Signed  Certificate Timestamps provided with certificates.  The switch&#39;s value is:  log_description:log_key,log_description:log_key,...  where  log_description is a textual description of the log.  log_key is a Base64&#39;d DER-encoded SubjectPublicKeyInfo of the log&#39;s  public key.  Multiple logs can be specified by repeating description:key pairs,  separated by a comma.  How often (in seconds) to check for updates. Should only be used for testing  purposes.","condition":null,"new":false},"cipher-suite-blacklist":{"original":"kCipherSuiteBlacklist","comment":"Checks the cloud print connector policy, informing the service process if  the policy is set to disallow the connector, then quits.  Comma-separated list of SSL cipher suites to disable.","condition":null,"new":false},"cloud-print-file":{"original":"kCloudPrintFile","comment":"Tells chrome to display the cloud print dialog and upload the specified file  for printing.","condition":null,"new":false},"cloud-print-file-type":{"original":"kCloudPrintFileType","comment":"Specifies the mime type to be used when uploading data from the file  referenced by cloud-print-file. Defaults to \"application\/pdf\" if  unspecified.","condition":null,"new":false},"cloud-print-print-ticket":{"original":"kCloudPrintPrintTicket","comment":"Used with kCloudPrintFile to specify a JSON print ticket for the resulting  print job. Defaults to null if unspecified.","condition":null,"new":false},"cloud-print-job-title":{"original":"kCloudPrintJobTitle","comment":"Used with kCloudPrintFile to specify a title for the resulting print job.","condition":null,"new":false},"cloud-print-setup-proxy":{"original":"kCloudPrintSetupProxy","comment":"Setup cloud print proxy for provided printers. This does not start  service or register proxy for autostart.","condition":null,"new":false},"cloud-print-service":{"original":"kCloudPrintServiceURL","comment":"The URL of the cloud print service to use, overrides any value stored in  preferences, and the default. Only used if the cloud print service has been  enabled (see enable-cloud-print).","condition":null,"new":false},"component-updater":{"original":"kComponentUpdater","comment":"Comma-separated options to troubleshoot the component updater. Only valid  for the browser process.","condition":null,"new":false},"conflicting-modules-check":{"original":"kConflictingModulesCheck","comment":"Causes the browser process to inspect loaded and registered DLLs for known  conflicts and warn the user.","condition":null,"new":false},"crash-on-hang-threads":{"original":"kCrashOnHangThreads","comment":"Comma-separated list of BrowserThreads that cause browser process to crash  if the given browser thread is not responsive. UI,IO,DB,FILE,CACHE are the  list of BrowserThreads that are supported.  For example:  --crash-on-hang-threads=UI:3:18,IO:3:18 --> Crash the browser if UI or IO  is not responsive for 18 seconds and the number of browser threads that  are responding is less than or equal to 3.","condition":null,"new":false},"data-reduction-proxy-probe-url":{"original":"kDataReductionProxyProbeURL","comment":"Some platforms like ChromeOS default to empty desktop.  Browser tests may need to add this switch so that at least one browser  instance is created on startup.  TODO(nkostylev): Investigate if this switch could be removed.  (http:crbug.com\/148675)  If set, the data reduction proxy will only be enabled if a request for this  URL is successful.","condition":" 0 || 1","new":false},"debug-enable-frame-toggle":{"original":"kDebugEnableFrameToggle","comment":"Enables a frame context menu item that toggles the frame in and out of glass  mode (Windows Vista and up only).","condition":null,"new":false},"debug-packed-apps":{"original":"kDebugPackedApps","comment":"Adds debugging entries such as Inspect Element to context menus of packed  apps.","condition":null,"new":false},"diagnostics":{"original":"kDiagnostics","comment":"Triggers a plethora of diagnostic modes.","condition":null,"new":false},"diagnostics-format":{"original":"kDiagnosticsFormat","comment":"Sets the output format for diagnostic modes enabled by diagnostics flag.","condition":null,"new":false},"diagnostics-recovery":{"original":"kDiagnosticsRecovery","comment":"Tells the diagnostics mode to do the requested recovery step(s).","condition":null,"new":false},"disable-async-dns":{"original":"kDisableAsyncDns","comment":"Disables the experimental asynchronous DNS client.","condition":null,"new":false},"disable-background-mode":{"original":"kDisableBackgroundMode","comment":"Disables CNAME lookup of the host when generating the Kerberos SPN for a  Negotiate challenge. See HttpAuthHandlerNegotiate::CreateSPN for more  background.  Disables background mode (background apps will not keep chrome running in  the background).","condition":null,"new":false},"disable-background-networking":{"original":"kDisableBackgroundNetworking","comment":"Disable several subsystems which run network requests in the background.  This is for use when doing network performance testing to avoid noise in the  measurements.","condition":null,"new":false},"disable-bundled-ppapi-flash":{"original":"kDisableBundledPpapiFlash","comment":"Disables the bundled PPAPI version of Flash.","condition":null,"new":false},"disable-component-update":{"original":"kDisableComponentUpdate","comment":"Disables the client-side phishing detection feature. Note that even if  client-side phishing detection is enabled, it will only be active if the  user has opted in to UMA stats and SafeBrowsing is enabled in the  preferences.  Disable default component extensions with background pages - useful for  performance tests where these pages may interfere with perf results.","condition":null,"new":false},"disable-crl-sets":{"original":"kDisableCRLSets","comment":"Disables establishing certificate revocation information by downloading a  set of CRLs rather than performing on-line checks.","condition":null,"new":false},"disable-default-apps":{"original":"kDisableDefaultApps","comment":"Disables installation of default apps on first run. This is used during  automated testing.","condition":null,"new":false},"disable-device-discovery":{"original":"kDisableDeviceDiscovery","comment":"Disables device discovery.","condition":null,"new":false},"disable-domain-reliability":{"original":"kDisableDomainReliability","comment":"Disables device discovery notifications.  Disables Domain Reliability Monitoring.","condition":null,"new":false},"disable-extensions":{"original":"kDisableExtensions","comment":"Disable extensions.","condition":null,"new":false},"disable-fullscreen-within-tab":{"original":"kDisableFullscreenWithinTab","comment":"Disable checking for user opt-in for extensions that want to inject script  into file URLs (ie, always allow it). This is used during automated testing.  Disable the net::URLRequestThrottlerManager functionality for  requests originating from extensions.  Disable mandatory enforcement of web_accessible_resources in extensions.  Disables embedding of Flash fullscreen widgets within the browser window.  This restores the old code paths where Flash fullscreen would display in its  own separate, always-on-top window.  In addition, this disables the new logic  which would prevent fullscreening the browser window during screen-capture of  a tab.  http:crbug.com\/256870 and http:crbug.com\/290403","condition":null,"new":false},"disable-infobars":{"original":"kDisableInfoBars","comment":"Prevent infobars from appearing.","condition":null,"new":false},"disable-ipv6":{"original":"kDisableIPv6","comment":"Don&#39;t resolve hostnames to IPv6 addresses. This can be used when debugging  issues relating to IPv6, but shouldn&#39;t otherwise be needed. Be sure to file  bugs if something isn&#39;t working properly in the presence of IPv6. This flag  can be overidden by the \"enable-ipv6\" flag.","condition":null,"new":false},"disable-ntp-other-sessions-menu":{"original":"kDisableNTPOtherSessionsMenu","comment":"Disable the behavior that the second click on a launcher item (the click when  the item is already active) minimizes the item.  Disables the menu on the NTP for accessing sessions from other devices.","condition":null,"new":false},"disable-origin-chip":{"original":"kDisableOriginChip","comment":"Disable the origin chip.","condition":null,"new":false},"disable-origin-chip-v2":{"original":"kDisableOriginChipV2","comment":"Disable the origin chip in the location bar.","condition":null,"new":false},"disable-people-search":{"original":"kDisablePeopleSearch","comment":"Disable the setting to prompt the user for their OS account password before  revealing plaintext passwords in the password manager.  Enables searching for people from the apps list search box.","condition":null,"new":false},"disable-popup-blocking":{"original":"kDisablePopupBlocking","comment":"Disable pop-up blocking.","condition":null,"new":false},"disable-pnacl":{"original":"kDisablePnacl","comment":"Disables the usage of Portable Native Client.","condition":null,"new":false},"disable-preconnect":{"original":"kDisablePreconnect","comment":"Disable speculative TCP\/IP preconnection.","condition":null,"new":false},"disable-prompt-on-repost":{"original":"kDisablePromptOnRepost","comment":"Disable prerendering based on local browsing history.  Normally when the user attempts to navigate to a page that was the result of  a post we prompt to make sure they want to. This switch may be used to  disable that check. This switch is used during automated testing.","condition":null,"new":false},"disable-quic":{"original":"kDisableQuic","comment":"Disables support for the QUIC protocol.","condition":null,"new":false},"disable-quic-https":{"original":"kDisableQuicHttps","comment":"Disables support for the HTTPS over QUIC protocol.  This is a temporary  testing flag.  This only has an effect if QUIC protocol is enabled.","condition":null,"new":false},"disable-quic-pacing":{"original":"kDisableQuicPacing","comment":"Disable use of pacing of QUIC packets.  This only has an effect if QUIC protocol is enabled.","condition":null,"new":false},"disable-quic-port-selection":{"original":"kDisableQuicPortSelection","comment":"Disable use of Chromium&#39;s port selection for the ephemeral port via bind().  This only has an effect if QUIC protocol is enabled.","condition":null,"new":false},"disable-save-password-bubble":{"original":"kDisableSavePasswordBubble","comment":"Prevents the URLs of BackgroundContents from being remembered and  re-launched when the browser restarts.  Prevents the save password bubble from being enabled.","condition":null,"new":false},"disable-spdy31":{"original":"kDisableSpdy31","comment":"Disables throttling prints initiated by scripts.  Disables the \"search button in omnibox\" experiment.  Disable SPDY\/3.1. This is a temporary testing flag.","condition":null,"new":false},"disable-sync":{"original":"kDisableSync","comment":"Disables syncing browser data to a Google Account.","condition":null,"new":false},"disable-sync-sessions-v2":{"original":"kDisableSyncSessionsV2","comment":"Disables sync\/API based session sync implementation (back to legacy).","condition":null,"new":false},"disable-sync-types":{"original":"kDisableSyncTypes","comment":"Disable synced notifications.  Disables syncing one or more sync data types that are on by default.  See sync\/internal_api\/public\/base\/model_type.h for possible types. Types  should be comma separated, and follow the naming convention for string  representation of model types, e.g.:  --disable-synctypes=&#39;Typed URLs, Bookmarks, Autofill Profiles&#39;","condition":null,"new":false},"disable-tls-channel-id":{"original":"kDisableTLSChannelID","comment":"Disables TLS Channel ID extension.","condition":null,"new":false},"disable-user-media-security":{"original":"kDisableUserMediaSecurity","comment":"Disables some security measures when accessing user media devices like  webcams and microphones, especially on non-HTTPS pages.","condition":null,"new":false},"disable-web-resources":{"original":"kDisableWebResources","comment":"Disables the backend service for web resources.","condition":null,"new":false},"disk-cache-dir":{"original":"kDiskCacheDir","comment":"Some tests seem to require the application to close when the last  browser window is closed. Thus, we need a switch to force this behavior  for ChromeOS Aura, disable \"zero window mode\".  TODO(pkotwicz): Investigate if this bug can be removed.  (http:crbug.com\/119175)  Use a specific disk cache location, rather than one derived from the  UserDatadir.","condition":null,"new":false},"disk-cache-size":{"original":"kDiskCacheSize","comment":"Forces the maximum disk space to be used by the disk cache, in bytes.","condition":null,"new":false},"dns-log-details":{"original":"kDnsLogDetails","comment":"","condition":null,"new":false},"dns-prefetch-disable":{"original":"kDnsPrefetchDisable","comment":"Disables prefetching of DNS information.","condition":null,"new":false},"dump-browser-histograms":{"original":"kDumpBrowserHistograms","comment":"Requests that a running browser process dump its collected histograms to a  given file. The file is overwritten if it exists.","condition":null,"new":false},"enable-adview":{"original":"kEnableAdview","comment":"Overrides the path of Easy Unlock component app.  Enables the <adview> tag in packaged apps.","condition":null,"new":false},"enable-app-list":{"original":"kEnableAppList","comment":"If set, the app list will be enabled as if enabled from CWS.","condition":null,"new":false},"enable-app-window-controls":{"original":"kEnableAppWindowControls","comment":"Enables the <window-controls> tag in platform apps.","condition":null,"new":false},"enable-apps-show-on-first-paint":{"original":"kEnableAppsShowOnFirstPaint","comment":"Show apps windows after the first paint. Windows will be shown significantly  later for heavy apps loading resources synchronously but it will be  insignificant for apps that load most of their resources asynchronously.","condition":null,"new":false},"enable-async-dns":{"original":"kEnableAsyncDns","comment":"Enables the experimental asynchronous DNS client.","condition":null,"new":false},"enable-auth-negotiate-port":{"original":"kEnableAuthNegotiatePort","comment":"Enables the inclusion of non-standard ports when generating the Kerberos SPN  in response to a Negotiate challenge. See  HttpAuthHandlerNegotiate::CreateSPN for more background.","condition":null,"new":false},"enable-autologin":{"original":"kEnableAutologin","comment":"Enables the pre- and auto-login features. When a user signs in to sync, the  browser&#39;s cookie jar is pre-filled with GAIA cookies. When the user visits a  GAIA login page, an info bar can help the user login.","condition":null,"new":false},"enable-automation-api":{"original":"kEnableAutomationAPI","comment":"Enables the Automation extension API.  TODO(dtseng): Remove once API enabled for stable channel.","condition":null,"new":false},"enable-benchmarking":{"original":"kEnableBenchmarking","comment":"Enables the benchmarking extensions.","condition":null,"new":false},"enable-client-hints":{"original":"kEnableClientHints","comment":"Enables client hints, which adds hints about browser state to HTTP requests.","condition":null,"new":false},"enable-bookmark-undo":{"original":"kEnableBookmarkUndo","comment":"Enables the multi-level undo system for bookmarks.","condition":null,"new":false},"enable-cloud-print-proxy":{"original":"kEnableCloudPrintProxy","comment":"This applies only when the process type is \"service\". Enables the Cloud  Print Proxy component within the service process.","condition":null,"new":false},"enable-devtools-experiments":{"original":"kEnableDevToolsExperiments","comment":"If true devtools experimental settings are enabled.","condition":null,"new":false},"enable-dom-distiller":{"original":"kEnableDomDistiller","comment":"Enable device discovery notifications.  Enables the DOM distiller.","condition":null,"new":false},"enable-domain-reliability":{"original":"kEnableDomainReliability","comment":"Enables Domain Reliability Monitoring.","condition":null,"new":false},"enhanced-bookmarks-experiment":{"original":"kEnhancedBookmarksExperiment","comment":"Enable Enhanced Bookmarks.","condition":null,"new":false},"enable-ephemeral-apps":{"original":"kEnableEphemeralApps","comment":"Enables Easy Unlock to be set up and used.  Enables experimentation with ephemeral apps, which are launched without  installing in Chrome.","condition":null,"new":false},"enable-fast-unload":{"original":"kEnableFastUnload","comment":"Enables logging for extension activity.  Enable the fast unload controller, which speeds up tab\/window close by  running a tab&#39;s onunload js handler independently of the GUI -  crbug.com\/142458 .","condition":null,"new":false},"enable-http2-draft-04":{"original":"kEnableHttp2Draft04","comment":"Enable HTTP\/2 draft 04. This is a temporary testing flag.","condition":null,"new":false},"enable-web-based-signin":{"original":"kEnableWebBasedSignin","comment":"Enables the pure web-based flow for sign in on first run\/NTP\/wrench menu\/  settings page.","condition":null,"new":false},"enable-ipv6":{"original":"kEnableIPv6","comment":"Enables IPv6 support, even if probes suggest that it may not be fully  supported. Some probes may require internet connections, and this flag will  allow support independent of application testing. This flag overrides  \"disable-ipv6\" which appears elswhere in this file.","condition":null,"new":false},"enable-linkable-ephemeral-apps":{"original":"kEnableLinkableEphemeralApps","comment":"Enables experimentation with launching ephemeral apps via hyperlinks.","condition":null,"new":false},"enable-nacl":{"original":"kEnableNaCl","comment":"Enables metrics recording and reporting in the browser startup sequence, as  if this was an official Chrome build where the user allowed metrics  reporting. This is used for testing only.  Runs the Native Client inside the renderer process and enables GPU plugin  (internally adds lEnableGpuPlugin to the command line).","condition":null,"new":false},"enable-net-benchmarking":{"original":"kEnableNetBenchmarking","comment":"Enables the network-related benchmarking extensions.","condition":null,"new":false},"enable-network-time":{"original":"kEnableNetworkTime","comment":"Enables |NetworkTimeService| to convert local time to network time.","condition":null,"new":false},"enable-npn-http":{"original":"kEnableNpnHttpOnly","comment":"Enables NPN with HTTP. It means NPN is enabled but SPDY won&#39;t be used.  HTTP is still used for all requests.","condition":null,"new":false},"enable-offline-auto-reload":{"original":"kEnableOfflineAutoReload","comment":"Enable auto-reload of error pages if offline.","condition":null,"new":false},"enable-origin-chip":{"original":"kEnableOriginChip","comment":"Controls which branch of the origin chip experiment is enabled. The first  flag (enable-origin-chip) is equivalent to the third  (enable-origin-chip-trailing-location-bar) and exists for backwards  compatability with an earlier version of the experiment.  We&#39;re using independent flags here (as opposed to a common flag with  different values) to be able to enable\/disable the entire experience  associated with this feature server-side from the FieldTrial (the complete  experience includes other flag changes as well). It is not currently possible  to do that with \"flag=value\" flags.","condition":null,"new":false},"enable-origin-chip-v2":{"original":"kEnableOriginChipV2","comment":"Controls which branch of the origin chip in location bar experiment is  enabled.  We&#39;re using independent flags here (as opposed to a common flag with  different values) to be able to enable\/disable the entire experience  associated with this feature server-side from the FieldTrial (the complete  experience includes other flag changes as well). It is not currently possible  to do that with \"flag=value\" flags.","condition":null,"new":false},"enable-panels":{"original":"kEnablePanels","comment":"Enables panels (always on-top docked pop-up windows).","condition":null,"new":false},"enable-privet-storage":{"original":"kEnablePrivetStorage","comment":"Enables showing unregistered printers in print preview  Enable Privet storage.","condition":null,"new":false},"enable-profiling":{"original":"kEnableProfiling","comment":"Enables tracking of tasks in profiler for viewing via about:profiler.  To predominantly disable tracking (profiling), use the command line switch:  --enable-profiling=0  Some tracking will still take place at startup, but it will be turned off  during chrome_browser_main.","condition":null,"new":false},"enable-query-extraction":{"original":"kEnableQueryExtraction","comment":"Enables query in the omnibox.","condition":null,"new":false},"enable-quic":{"original":"kEnableQuic","comment":"Enables support for the QUIC protocol.  This is a temporary testing flag.","condition":null,"new":false},"enable-quic-https":{"original":"kEnableQuicHttps","comment":"Enables support for the HTTPS over QUIC protocol.  This is a temporary  testing flag.  This only has an effect if QUIC protocol is enabled.","condition":null,"new":false},"enable-quic-pacing":{"original":"kEnableQuicPacing","comment":"Disable use of pacing of QUIC packets.  This only has an effect if QUIC protocol is enabled.","condition":null,"new":false},"enable-quic-port-selection":{"original":"kEnableQuicPortSelection","comment":"Enable use of Chromium&#39;s port selection for the ephemeral port via bind().  This only has an effect if QUIC protocol is enabled.","condition":null,"new":false},"enable-save-password-bubble":{"original":"kEnableSavePasswordBubble","comment":"Enables save password prompt bubble.","condition":null,"new":false},"enable-sdch-over-https":{"original":"kEnableSdchOverHttps","comment":"Enables SDCH for https schemes.","condition":null,"new":false},"enable-settings-window":{"original":"kEnableSettingsWindow","comment":"Controls which branch of the \"search button in omnibox\" experiment is  enabled.  We&#39;re using independent flags here (as opposed to a common flag with  different values) to be able to enable\/disable the entire experience  associated with this feature server-side from the FieldTrial (the complete  experience includes other flag changes as well). It is not currently possible  to do that with \"flag=value\" flags.  Enable settings in a separate browser window per profile.","condition":null,"new":false},"enable-spdy4a2":{"original":"kEnableSpdy4a2","comment":"Enable SPDY\/4 alpha 2. This is a temporary testing flag.","condition":null,"new":false},"enable-spelling-auto-correct":{"original":"kEnableSpellingAutoCorrect","comment":"Enables auto correction for misspelled words.","condition":null,"new":false},"enable-stacked-tab-strip":{"original":"kEnableStackedTabStrip","comment":"Enables participation in the field trial for user feedback to spelling  service.  Enables the stacked tabstrip.","condition":null,"new":false},"enable-streamlined-hosted-apps":{"original":"kEnableStreamlinedHostedApps","comment":"Enables an experimental hosted app experience.","condition":null,"new":false},"enable-sync-articles":{"original":"kEnableSyncArticles","comment":"Enables synced notifications.  Enables synced articles.","condition":null,"new":false},"enable-thumbnail-retargeting":{"original":"kEnableThumbnailRetargeting","comment":"Enables fanciful thumbnail processing. Used with NTP for  instant-extended-api, where thumbnails are generally smaller.","condition":null,"new":false},"enable-translate-new-ux":{"original":"kEnableTranslateNewUX","comment":"Enables Translate experimental new UX which replaces the infobar.","condition":null,"new":false},"enable-watchdog":{"original":"kEnableWatchdog","comment":"Enables Alternate-Protocol when the port is user controlled (> 1024).  Spawns threads to watch for excessive delays in specified message loops.  User should set breakpoints on Alarm() to examine problematic thread.  Usage:   -enable-watchdog=[ui][io]  Order of the listed sub-arguments does not matter.","condition":null,"new":false},"enable-websocket-over-spdy":{"original":"kEnableWebSocketOverSpdy","comment":"Uses WebSocket over SPDY.","condition":null,"new":false},"explicitly-allowed-ports":{"original":"kExplicitlyAllowedPorts","comment":"Explicitly allows additional ports using a comma-separated list of port  numbers.","condition":null,"new":false},"extensions-install-verification":{"original":"kExtensionsInstallVerification","comment":"Turns on extension install verification if it would not otherwise have been  turned on.","condition":null,"new":false},"extensions-not-webstore":{"original":"kExtensionsNotWebstore","comment":"Specifies a comma-separated list of extension ids that should be forced to  be treated as not from the webstore when doing install verification.","condition":null,"new":false},"extensions-update-frequency":{"original":"kExtensionsUpdateFrequency","comment":"Frequency in seconds for Extensions auto-update.","condition":null,"new":false},"extra-search-query-params":{"original":"kExtraSearchQueryParams","comment":"Additional query params to insert in the search and instant URLs.  Useful for  testing.","condition":null,"new":false},"fake-variations-channel":{"original":"kFakeVariationsChannel","comment":"Fakes the channel of the browser for purposes of Variations filtering. This  is to be used for testing only. Possible values are \"stable\", \"beta\", \"dev\"  and \"canary\". Note that this only applies if the browser&#39;s reported channel  is UNKNOWN.","condition":null,"new":false},"fast-start":{"original":"kFastStart","comment":"If this flag is present then this command line is being delegated to an  already running chrome process via the fast path, ie: before chrome.dll is  loaded. It is useful to tell the difference for tracking purposes.","condition":null,"new":false},"fast-user-switching":{"original":"kFastUserSwitching","comment":"Allows displaying the list of existing profiles in the avatar bubble for  fast switching between profiles.","condition":null,"new":false},"flag-switches-begin":{"original":"kFlagSwitchesBegin","comment":"These two flags are added around the switches about:flags adds to the  command line. This is useful to see which switches were added by about:flags  on about:version. They don&#39;t have any effect.","condition":null,"new":false},"flag-switches-end":{"original":"kFlagSwitchesEnd","comment":"","condition":null,"new":false},"feedback-server":{"original":"kFeedbackServer","comment":"Alternative feedback server to use when submitting user feedback","condition":null,"new":false},"file-descriptor-limit":{"original":"kFileDescriptorLimit","comment":"The file descriptor limit is set to the value of this switch, subject to the  OS hard limits. Useful for testing that file descriptor exhaustion is  handled gracefully.","condition":null,"new":false},"force-app-mode":{"original":"kForceAppMode","comment":"Forces application mode. This hides certain system UI elements and forces  the app to be installed if it hasn&#39;t been already.","condition":null,"new":false},"force-first-run":{"original":"kForceFirstRun","comment":"Displays the First Run experience when the browser is started, regardless of  whether or not it&#39;s actually the First Run (this overrides kNoFirstRun).","condition":null,"new":false},"force-variation-ids":{"original":"kForceVariationIds","comment":"Forces additional Chrome Variation Ids that will be sent in X-Client-Data  header, specified as a 64-bit encoded list of numeric experiment ids. Ids  prefixed with the character \"t\" will be treated as Trigger Variation Ids.","condition":null,"new":false},"google-base-url":{"original":"kGoogleBaseURL","comment":"Specifies an alternate URL to use for speaking to Google. Useful for testing.","condition":null,"new":false},"google-profile-info":{"original":"kGoogleProfileInfo","comment":"Enables using GAIA information to populate profile name and icon.","condition":null,"new":false},"gssapi-library-name":{"original":"kGSSAPILibraryName","comment":"Specifies a custom name for the GSSAPI library to load.","condition":null,"new":false},"help":{"original":"kHelp","comment":"These flags show the man page on Linux. They are equivalent to each  other.","condition":null,"new":false},"HelpShort: \"h\"":{"original":"kHelpShort","comment":"","condition":null,"new":false},"hide-icons":{"original":"kHideIcons","comment":"Makes Windows happy by allowing it to show \"Enable access to this program\"  checkbox in Add\/Remove Programs->Set Program Access and Defaults. This only  shows an error box because the only way to hide Chrome is by uninstalling  it.","condition":null,"new":false},"enable-grouped-history":{"original":"kHistoryEnableGroupByDomain","comment":"Enables grouping websites by domain and filtering them by period.","condition":null,"new":false},"homepage":{"original":"kHomePage","comment":"Specifies which page will be displayed in newly-opened tabs. We need this  for testing purposes so that the UI tests don&#39;t depend on what comes up for  http:google.com.","condition":null,"new":false},"host-rules":{"original":"kHostRules","comment":"Comma-separated list of rules that control how hostnames are mapped.  For example:  \"MAP * 127.0.0.1\" --> Forces all hostnames to be mapped to 127.0.0.1  \"MAP *.google.com proxy\" --> Forces all google.com subdomains to be  resolved to \"proxy\".  \"MAP test.com [::1]:77 --> Forces \"test.com\" to resolve to IPv6 loopback.  Will also force the port of the resulting  socket address to be 77.  \"MAP * baz, EXCLUDE www.google.com\" --> Remaps everything to \"baz\",  except for \"www.google.com\".  These mappings apply to the endpoint host in a net::URLRequest (the TCP  connect and host resolver in a direct connection, and the CONNECT in an http  proxy connection, and the endpoint host in a SOCKS proxy connection).","condition":null,"new":false},"host-resolver-parallelism":{"original":"kHostResolverParallelism","comment":"The maximum number of concurrent host resolve requests (i.e. DNS) to allow  (not counting backup attempts which would also consume threads).  --host-resolver-retry-attempts must be set to zero for this to be exact.","condition":null,"new":false},"host-resolver-retry-attempts":{"original":"kHostResolverRetryAttempts","comment":"The maximum number of retry attempts to resolve the host. Set this to zero  to disable host resolver retry attempts.","condition":null,"new":false},"incognito":{"original":"kIncognito","comment":"Causes net::URLFetchers to ignore requests for SSL client certificates,  causing them to attempt an unauthenticated SSL\/TLS session. This is intended  for use when testing various service URLs (eg: kPromoServerURL, kSbURLPrefix,  kSyncServiceURL, etc)  Causes the browser to launch directly in incognito mode.","condition":null,"new":false},"install-chrome-app":{"original":"kInstallChromeApp","comment":"Causes Chrome to initiate an installation flow for the given app.","condition":null,"new":false},"install-from-webstore":{"original":"kInstallFromWebstore","comment":"Causes Chrome to attempt to get metadata from the webstore for the  app\/extension ID given, and then prompt the user to download and install it.","condition":null,"new":false},"instant-process":{"original":"kInstantProcess","comment":"Marks a renderer as an Instant process.","condition":null,"new":false},"invalidation-use-gcm-channel":{"original":"kInvalidationUseGCMChannel","comment":"Invalidation service should use GCM network channel even if experiment is not  enabled.","condition":null,"new":false},"ipc-fuzzer-testcase":{"original":"kIpcFuzzerTestcase","comment":"Specifies the testcase used by the IPC fuzzer.","condition":null,"new":false},"keep-alive-for-test":{"original":"kKeepAliveForTest","comment":"Used for testing - keeps browser alive after last browser window closes.","condition":null,"new":false},"kiosk":{"original":"kKioskMode","comment":"Enable Kiosk mode.","condition":null,"new":false},"kiosk-printing":{"original":"kKioskModePrinting","comment":"Print automatically in kiosk mode. |kKioskMode| must be set as well.  See http:crbug.com\/31395.","condition":null,"new":false},"limited-install-from-webstore":{"original":"kLimitedInstallFromWebstore","comment":"Causes Chrome to attempt to get metadata from the webstore for the  given item, and then prompt the user to download and install it.","condition":null,"new":false},"load-component-extension":{"original":"kLoadComponentExtension","comment":"Comma-separated list of directories with component extensions to load.","condition":null,"new":false},"load-extension":{"original":"kLoadExtension","comment":"Loads an extension from the specified directory.","condition":null,"new":false},"make-default-browser":{"original":"kMakeDefaultBrowser","comment":"Makes Chrome default browser","condition":null,"new":false},"managed-user-id":{"original":"kManagedUserId","comment":"Sets the managed user ID for any loaded or newly created profile to the  given value. Pass an empty string to mark the profile as non-supervised.  Used for testing.","condition":null,"new":false},"managed-user-sync-token":{"original":"kManagedUserSyncToken","comment":"Used to authenticate requests to the Sync service for managed users. Setting  this switch also causes Sync to be set up for a managed user.","condition":null,"new":false},"manual-enhanced-bookmarks":{"original":"kManualEnhancedBookmarks","comment":"Use to opt-in user into Finch experiment groups.","condition":null,"new":false},"media-cache-size":{"original":"kMediaCacheSize","comment":"Forces the maximum disk space to be used by the media cache, in bytes.","condition":null,"new":false},"memory-profile":{"original":"kMemoryProfiling","comment":"Enables dynamic loading of the Memory Profiler DLL, which will trace all  memory allocations during the run.","condition":null,"new":false},"message-loop-histogrammer":{"original":"kMessageLoopHistogrammer","comment":"Enables histograming of tasks served by MessageLoop. See  about:histograms\/Loop for results, which show frequency of messages on each  thread, including APC count, object signalling count, etc.","condition":null,"new":false},"metrics-recording-only":{"original":"kMetricsRecordingOnly","comment":"Enables the recording of metrics reports but disables reporting. In contrast  to kDisableMetrics, this executes all the code that a normal client would  use for reporting, except the report is dropped rather than sent to the  server. This is useful for finding issues in the metrics code during UI and  performance tests.","condition":null,"new":false},"multi-profiles":{"original":"kMultiProfiles","comment":"Enables multiprofile Chrome.","condition":null,"new":false},"net-log-level":{"original":"kNetLogLevel","comment":"Sets the base logging level for the net log. Log 0 logs the most data.  Intended primarily for use with --log-net-log.","condition":null,"new":false},"new-avatar-menu":{"original":"kNewAvatarMenu","comment":"Use new avatar menu. When combined with new-profile-management, it simply  shows the new profile management avatar menu. Otherwise it shows a redesigned  avatar menu with the same functionality as the old one, plus a tutorial card  at the top prompting the user to try out the new profile management UI.","condition":null,"new":false},"new-profile-management":{"original":"kNewProfileManagement","comment":"Use new profile management system, including profile sign-out and new  choosers.","condition":null,"new":false},"no-default-browser-check":{"original":"kNoDefaultBrowserCheck","comment":"Disables the default browser check. Useful for UI\/browser tests where we  want to avoid having the default browser info-bar displayed.","condition":null,"new":false},"no-displaying-insecure-content":{"original":"kNoDisplayingInsecureContent","comment":"By default, an https page can load images, fonts or frames from an http  page. This switch overrides this to block this lesser mixed-content problem.","condition":null,"new":false},"no-events":{"original":"kNoEvents","comment":"Don&#39;t record\/playback events when using record & playback.","condition":null,"new":false},"no-experiments":{"original":"kNoExperiments","comment":"Disables all experiments set on about:flags. Does not disable about:flags  itself. Useful if an experiment makes chrome crash at startup: One can start  chrome with --no-experiments, disable the problematic lab at about:flags and  then restart chrome without this switch again.","condition":null,"new":false},"no-first-run":{"original":"kNoFirstRun","comment":"Skip First Run tasks, whether or not it&#39;s actually the First Run. Overridden  by kForceFirstRun. This does not drop the First Run sentinel and thus doesn&#39;t  prevent first run from occuring the next time chrome is launched without this  flag.","condition":null,"new":false},"no-js-randomness":{"original":"kNoJsRandomness","comment":"Support a separate switch that enables the v8 playback extension.  The extension causes javascript calls to Date.now() and Math.random()  to return consistent values, such that subsequent loads of the same  page will result in consistent js-generated data and XHR requests.  Pages may still be able to generate inconsistent data from plugins.","condition":null,"new":false},"no-network-profile-warning":{"original":"kNoNetworkProfileWarning","comment":"Whether or not the browser should warn if the profile is on a network share.  This flag is only relevant for Windows currently.","condition":null,"new":false},"no-pings":{"original":"kNoPings","comment":"Don&#39;t send hyperlink auditing pings","condition":null,"new":false},"no-proxy-server":{"original":"kNoProxyServer","comment":"Don&#39;t use a proxy server, always make direct connections. Overrides any  other proxy server flags that are passed.","condition":null,"new":false},"no-service-autorun":{"original":"kNoServiceAutorun","comment":"Disables the service process from adding itself as an autorun process. This  does not delete existing autorun registrations, it just prevents the service  from registering a new one.","condition":null,"new":false},"no-startup-window":{"original":"kNoStartupWindow","comment":"Does not automatically open a browser window on startup (used when  launching Chrome for the purpose of hosting background apps).","condition":null,"new":false},"num-pac-threads":{"original":"kNumPacThreads","comment":"Disables checking whether we received an acknowledgment when registering  a supervised user. Also disables the timeout during registration that waits  for the ack. Useful when debugging against a server that does not  support notifications.  Specifies the maximum number of threads to use for running the Proxy  Autoconfig (PAC) script.","condition":null,"new":false},"new-window":{"original":"kOpenInNewWindow","comment":"Launches URL in new browser window.","condition":null,"new":false},"origin-to-force-quic-on":{"original":"kOriginToForceQuicOn","comment":"Force use of QUIC for requests to the specified origin.","condition":null,"new":false},"original-process-start-time":{"original":"kOriginalProcessStartTime","comment":"The time that a new chrome process which is delegating to an already running  chrome process started. (See ProcessSingleton for more details.)","condition":null,"new":false},"out-of-process-pdf":{"original":"kOutOfProcessPdf","comment":"Enable the out of process PDF plugin.","condition":null,"new":false},"pack-extension":{"original":"kPackExtension","comment":"Packages an extension to a .crx installable file from a given directory.","condition":null,"new":false},"pack-extension-key":{"original":"kPackExtensionKey","comment":"Optional PEM private key to use in signing packaged .crx.","condition":null,"new":false},"parent-profile":{"original":"kParentProfile","comment":"Specifies the path to the user data folder for the parent profile.","condition":null,"new":false},"performance-monitor-gathering":{"original":"kPerformanceMonitorGathering","comment":"Launches PerformanceMonitor at startup, which will gather statistics about  Chrome&#39;s CPU and memory usage, page load times, startup times, and network  usage, and will also store information about events which may be of interest,  such as extension-related occurrences and crashes. Optionally, this may be  run with an integer value representing the interval between the timed  metric gatherings, measured in seconds (if invalid or not provided, the  default interval is used).","condition":null,"new":false},"playback-mode":{"original":"kPlaybackMode","comment":"Read previously recorded data from the cache. Only cached data is read.  See kRecordMode.","condition":null,"new":false},"ppapi-flash-path":{"original":"kPpapiFlashPath","comment":"Use the PPAPI (Pepper) Flash found at the given path.","condition":null,"new":false},"ppapi-flash-version":{"original":"kPpapiFlashVersion","comment":"Report the given version for the PPAPI (Pepper) Flash. The version should be  numbers separated by &#39;.&#39;s (e.g., \"12.3.456.78\"). If not specified, it  defaults to \"10.2.999.999\".","condition":null,"new":false},"prefetch-search-results":{"original":"kPrefetchSearchResults","comment":"Triggers prerendering of search base page to prefetch results for the typed  omnibox query. Only has an effect when prerender is enabled.","condition":null,"new":false},"prerender-from-omnibox":{"original":"kPrerenderFromOmnibox","comment":"Triggers prerendering of pages from suggestions in the omnibox. Only has an  effect when Instant is either disabled or restricted to search, and when  prerender is enabled.","condition":null,"new":false},"auto":{"original":"kPrerenderModeSwitchValueAuto","comment":"These are the values the kPrerenderMode switch may have, as in  \"--prerender=auto\".  auto: Allow field trial selection for prerender.","condition":null,"new":false},"disabled":{"original":"kPrerenderModeSwitchValueDisabled","comment":"disabled: No prerendering.","condition":null,"new":false},"enabled":{"original":"kPrerenderModeSwitchValueEnabled","comment":"enabled: Prerendering.","condition":null,"new":false},"prerender":{"original":"kPrerenderMode","comment":"Controls speculative prerendering of pages, and content prefetching. Both  are dispatched from <link rel=prefetch href=...> elements.","condition":null,"new":false},"privet-ipv6-only":{"original":"kPrivetIPv6Only","comment":"Use IPv6 only for privet HTTP.","condition":null,"new":false},"product-version":{"original":"kProductVersion","comment":"Outputs the product version information and quit. Used as an internal api to  detect the installed version of Chrome on Linux.","condition":null,"new":false},"profile-directory":{"original":"kProfileDirectory","comment":"Selects directory of profile to associate with the first browser launched.","condition":null,"new":false},"profiling-at-start":{"original":"kProfilingAtStart","comment":"Starts the sampling based profiler for the browser process at startup. This  will only work if chrome has been built with the gyp variable profiling=1.  The output will go to the value of kProfilingFile.","condition":null,"new":false},"profiling-file":{"original":"kProfilingFile","comment":"Specifies a location for profiling output. This will only work if chrome has  been built with the gyp variable profiling=1.  {pid} if present will be replaced by the pid of the process.  {count} if present will be incremented each time a profile is generated  for this process.  The default is chrome-profile-{pid}.","condition":null,"new":false},"profiling-output-file":{"original":"kProfilingOutputFile","comment":"Specifies a path for the output of task-level profiling which can be loaded  and viewed in about:profiler.","condition":null,"new":false},"profiling-flush":{"original":"kProfilingFlush","comment":"Controls whether profile data is periodically flushed to a file. Normally  the data gets written on exit but cases exist where chrome doesn&#39;t exit  cleanly (especially when using single-process). A time in seconds can be  specified.","condition":null,"new":false},"promo-server-url":{"original":"kPromoServerURL","comment":"Specifies a custom URL for fetching NTP promo data.","condition":null,"new":false},"proxy-auto-detect":{"original":"kProxyAutoDetect","comment":"Forces proxy auto-detection.","condition":null,"new":false},"proxy-bypass-list":{"original":"kProxyBypassList","comment":"Specifies a list of hosts for whom we bypass proxy settings and use direct  connections. Ignored if --proxy-auto-detect or --no-proxy-server are also  specified. This is a comma-separated list of bypass rules. See:  \"net\/proxy\/proxy_bypass_rules.h\" for the format of these rules.","condition":null,"new":false},"proxy-pac-url":{"original":"kProxyPacUrl","comment":"Uses the pac script at the given URL","condition":null,"new":false},"proxy-server":{"original":"kProxyServer","comment":"Uses a specified proxy server, overrides system settings. This switch only  affects HTTP and HTTPS requests.","condition":null,"new":false},"quic-max-packet-length":{"original":"kQuicMaxPacketLength","comment":"Specifies the maximum length for a QUIC packet.","condition":null,"new":false},"quic-version":{"original":"kQuicVersion","comment":"Specifies the version of QUIC to use.","condition":null,"new":false},"record-mode":{"original":"kRecordMode","comment":"Chrome supports a playback and record mode.  Record mode saves *everything*  to the cache.  Playback mode reads data exclusively from the cache.  This  allows us to record a session into the cache and then replay it at will.  See also kPlaybackMode.","condition":null,"new":false},"renderer-print-preview":{"original":"kRendererPrintPreview","comment":"Enables print preview in the renderer. This flag is generated internally by  Chrome and does nothing when directly passed to the browser.","condition":null,"new":false},"reset-app-list-install-state":{"original":"kResetAppListInstallState","comment":"If set, the app list will forget it has been installed on startup. Note this  doesn&#39;t prevent the app list from running, it just makes Chrome think the app  list hasn&#39;t been enabled (as in kEnableAppList) yet.","condition":null,"new":false},"reset-variation-state":{"original":"kResetVariationState","comment":"Forces a reset of the one-time-randomized FieldTrials on this client, also  known as the Chrome Variations state.","condition":null,"new":false},"restore-last-session":{"original":"kRestoreLastSession","comment":"Indicates the last session should be restored on startup. This overrides the  preferences value and is primarily intended for testing. The value of this  switch is the number of tabs to wait until loaded before &#39;load completed&#39; is  sent to the ui_test.","condition":null,"new":false},"save-page-as-mhtml":{"original":"kSavePageAsMHTML","comment":"Disable saving pages as HTML-only, disable saving pages as HTML Complete  (with a directory of sub-resources). Enable only saving pages as MHTML.  See http:crbug.com\/120416 for how to remove this switch.","condition":null,"new":false},"safebrowsing-disable-auto-update":{"original":"kSbDisableAutoUpdate","comment":"If present, safebrowsing only performs update when  SafeBrowsingProtocolManager::ForceScheduleNextUpdate() is explicitly called.  This is used for testing only.","condition":null,"new":false},"safebrowsing-download-feedback-url":{"original":"kSbDownloadFeedbackURL","comment":"TODO(lzheng): Remove this flag once the feature works fine  (http:crbug.com\/74848).  Disables safebrowsing feature that checks download url and downloads  content&#39;s hash to make sure the content are not malicious.  Disables safebrowsing feature that checks for blacklisted extensions.  Disables safebrowsing feature that provides a side-effect free whitelist.  URL to send safebrowsing download feedback reports to.","condition":null,"new":false},"service":{"original":"kServiceProcess","comment":"Causes the process to run as a service process.","condition":null,"new":false},"set-token":{"original":"kSetToken","comment":"Sets a token in the token service, for testing.","condition":null,"new":false},"show-app-list":{"original":"kShowAppList","comment":"If true the app list will be shown.","condition":null,"new":false},"show-icons":{"original":"kShowIcons","comment":"See kHideIcons.","condition":null,"new":false},"signin-process":{"original":"kSigninProcess","comment":"Marks a renderer as the signin process.","condition":null,"new":false},"silent-debugger-extension-api":{"original":"kSilentDebuggerExtensionAPI","comment":"Does not show an infobar when an extension attaches to a page using  chrome.debugger page. Required to attach to extension background pages.","condition":null,"new":false},"silent-dump-on-dcheck":{"original":"kSilentDumpOnDCHECK","comment":"Changes the DCHECKS to dump memory and continue instead of displaying error  dialog. This is valid only in Release mode when gyp dcheck_always_on=1.","condition":null,"new":false},"silent-launch":{"original":"kSilentLaunch","comment":"Causes Chrome to launch without opening any windows by default. Useful if  one wishes to use Chrome as an ash server.","condition":null,"new":false},"simulate-upgrade":{"original":"kSimulateUpgrade","comment":"Simulates an update being available.","condition":null,"new":false},"simulate-critical-update":{"original":"kSimulateCriticalUpdate","comment":"Simulates a critical update being available.","condition":null,"new":false},"simulate-outdated":{"original":"kSimulateOutdated","comment":"Simulates that current version is outdated.","condition":null,"new":false},"simulate-outdated-no-au":{"original":"kSimulateOutdatedNoAU","comment":"Simulates that current version is outdated and auto-update is off.","condition":null,"new":false},"spdy-proxy-auth-fallback":{"original":"kSpdyProxyAuthFallback","comment":"Replaces the buffered data source for <audio> and <video> with a simplified  resource loader that downloads the entire resource into memory.  Second origin that can be used for the spdy proxy.","condition":null,"new":false},"spdy-proxy-auth-origin":{"original":"kSpdyProxyAuthOrigin","comment":"Origin for which SpdyProxy authentication is supported.","condition":null,"new":false},"spdy-proxy-auth-value":{"original":"kSpdyProxyAuthValue","comment":"Authentication string for the data reduction proxy.","condition":null,"new":false},"spdy-proxy-dev-auth-origin":{"original":"kSpdyProxyDevAuthOrigin","comment":"Origin for which dev version of SpdyProxy authentication is supported.","condition":null,"new":false},"spelling-service-feedback-url":{"original":"kSpellingServiceFeedbackUrl","comment":"Specifies the URL where spelling service feedback data will be sent instead  of the default URL. This switch is for temporary testing only.  TODO(rouslan): Remove this flag when feedback testing is complete. Revisit by  August 2013.","condition":null,"new":false},"ssl-version-max":{"original":"kSSLVersionMax","comment":"Specifies the number of seconds between sending batches of feedback to  spelling service. The default is 30 minutes. The mininum is 5 seconds. This  switch is for temporary testing only.  TODO(rouslan): Remove this flag when feedback testing is complete. Revisit by  August 2013.  Specifies the maximum SSL\/TLS version (\"ssl3\", \"tls1\", \"tls1.1\", or  \"tls1.2\").","condition":null,"new":false},"ssl-version-min":{"original":"kSSLVersionMin","comment":"Specifies the minimum SSL\/TLS version (\"ssl3\", \"tls1\", \"tls1.1\", or  \"tls1.2\").","condition":null,"new":false},"start-maximized":{"original":"kStartMaximized","comment":"Starts the browser maximized, regardless of any previous settings.","condition":null,"new":false},"suggestion-ntp-filter-width":{"original":"kSuggestionNtpFilterWidth","comment":"Controls the width of time-of-day filters on the &#39;suggested&#39; ntp page, in  minutes.","condition":null,"new":false},"suggestion-ntp-gaussian-filter":{"original":"kSuggestionNtpGaussianFilter","comment":"Enables a normal distribution dropoff to the relevancy of visits with respect  to the time of day.","condition":null,"new":false},"suggestion-ntp-linear-filter":{"original":"kSuggestionNtpLinearFilter","comment":"Enables a linear dropoff to the relevancy of visits with respect to the time  of day.","condition":null,"new":false},"sync-invalidate-xmpp-login":{"original":"kSyncInvalidateXmppLogin","comment":"Allows insecure XMPP connections for sync (for testing).  Invalidates any login info passed into sync&#39;s XMPP connection.","condition":null,"new":false},"sync-notification-host-port":{"original":"kSyncNotificationHostPort","comment":"This flag causes sync to retry very quickly (see polling_constants.h) the  when it encounters an error, as the first step towards exponential backoff.  Overrides the default host:port used for sync notifications.","condition":null,"new":false},"sync-url":{"original":"kSyncServiceURL","comment":"Overrides the default server used for profile sync.","condition":null,"new":false},"sync-throw-unrecoverable-error":{"original":"kSyncThrowUnrecoverableError","comment":"Makes the sync code to throw an unrecoverable error after initialization.  Useful for testing unrecoverable error scenarios.","condition":null,"new":false},"sync-try-ssltcp-first-for-xmpp":{"original":"kSyncTrySsltcpFirstForXmpp","comment":"Tries to connect to XMPP using SSLTCP first (for testing).","condition":null,"new":false},"sync-disable-deferred-startup":{"original":"kSyncDisableDeferredStartup","comment":"Enables deferring sync backend initialization until user initiated changes  occur.","condition":null,"new":false},"test-name":{"original":"kTestName","comment":"Allows overriding the deferred init fallback timeout.  Enables feature to avoid unnecessary GetUpdate requests.  Enables directory support for sync filesystem  Passes the name of the current running automated test to Chrome.","condition":null,"new":false},"trusted-spdy-proxy":{"original":"kTrustedSpdyProxy","comment":"Disables same-origin check on HTTP resources pushed via a SPDY proxy.  The value is the host:port of the trusted proxy.","condition":null,"new":false},"try-chrome-again":{"original":"kTryChromeAgain","comment":"Experimental. Shows a dialog asking the user to try chrome. This flag is to  be used only by the upgrade process.","condition":null,"new":false},"uninstall-extension":{"original":"kUninstallExtension","comment":"Uninstalls an extension with the specified extension id.","condition":null,"new":false},"uninstall":{"original":"kUninstall","comment":"Runs un-installation steps that were done by chrome first-run.","condition":null,"new":false},"unlimited-storage":{"original":"kUnlimitedStorage","comment":"Overrides per-origin quota settings to unlimited storage for any  apps\/origins.  This should be used only for testing purpose.","condition":null,"new":false},"use-spdy":{"original":"kUseSpdy","comment":"Uses Spdy for the transport protocol instead of HTTP. This is a temporary  testing flag.","condition":null,"new":false},"use-spelling-suggestions":{"original":"kUseSpellingSuggestions","comment":"Disables use of the spelling web service and only provides suggestions.  This will only work if asynchronous spell checking is not disabled.","condition":null,"new":false},"user-agent":{"original":"kUserAgent","comment":"A string used to override the default user agent with a custom one.","condition":null,"new":false},"user-data-dir":{"original":"kUserDataDir","comment":"Specifies the user data directory, which is where the browser will look for  all of its state.","condition":null,"new":false},"validate-crx":{"original":"kValidateCrx","comment":"Examines a .crx for validity and prints the result.","condition":null,"new":false},"use-simple-cache-backend":{"original":"kUseSimpleCacheBackend","comment":"Uses experimental simple cache backend if possible.","condition":null,"new":false},"variations-server-url":{"original":"kVariationsServerURL","comment":"Specifies a custom URL for the server which reports variation data to the  client. Specifying this switch enables the Variations service on  unofficial builds. See variations_service.cc.","condition":null,"new":false},"version":{"original":"kVersion","comment":"Prints version information and quits.","condition":null,"new":false},"window-position":{"original":"kWindowPosition","comment":"Specify the initial window position: --window-position=x,y","condition":null,"new":false},"window-size":{"original":"kWindowSize","comment":"Specify the initial window size: --window-size=w,h","condition":null,"new":false},"winhttp-proxy-resolver":{"original":"kWinHttpProxyResolver","comment":"Uses WinHTTP to fetch and evaluate PAC scripts. Otherwise the default is to  use Chromium&#39;s network stack to fetch, and V8 to evaluate.","condition":null,"new":false},"plugins-metadata-server-url":{"original":"kPluginsMetadataServerURL","comment":"Specifies a custom URL for fetching plug-ins metadata. Used for testing.","condition":2,"new":false},"enable-spdy-proxy-auth":{"original":"kEnableSpdyProxyAuth","comment":"Enable SPDY proxy.","condition":" 0 || 1","new":false},"disable-app-banners":{"original":"kDisableAppBanners","comment":"Disables the app banner <meta> tag.","condition":0,"new":false},"disable-cast":{"original":"kDisableCast","comment":"Disables support for playing videos on Chromecast devices.","condition":0,"new":false},"disable-new-ntp":{"original":"kDisableNewNTP","comment":"Disables the new NTP.","condition":0,"new":false},"disable-zero-suggest":{"original":"kDisableZeroSuggest","comment":"Disables zero suggest experiment on Dev channel.","condition":0,"new":false},"contextual-search":{"original":"kEnableContextualSearch","comment":"Enable the accessibility tab switcher.  Enables Contextual Search","condition":0,"new":false},"enable-new-ntp":{"original":"kEnableNewNTP","comment":"Enables the new NTP.","condition":0,"new":false},"enable-instant-search-clicks":{"original":"kEnableInstantSearchClicks","comment":"Enables zero suggest functionality on Dev channel, showing contextual  suggestions (EtherSuggest) for http pages and google.com search queries.  Enables zero suggest functionality on Dev channel, showing contextual  suggestions (EtherSuggest) for http pages.  Enables zero suggest functionality on Dev channel, showing most visited  sites as default suggestions.  Enables zero suggest functionality on Dev channel, showing recently typed  queries as default suggestions.  Enables instant search clicks feature.","condition":0,"new":false},"open-ash":{"original":"kOpenAsh","comment":"","condition":3,"new":false},"password-store":{"original":"kPasswordStore","comment":"Specifies which password store to use (detect, default, gnome, kwallet).","condition":" 4 && !5 && !6","new":false},"migrate-data-dir-for-sxs":{"original":"kMigrateDataDirForSxS","comment":"Triggers migration of user data directory to another directory  specified as a parameter. The migration is done under singleton lock,  and sanity checks are made to avoid corrupting the profile.  The browser exits after migration is complete.","condition":" 7 && 6","new":false},"enable-speech-dispatcher":{"original":"kEnableSpeechDispatcher","comment":"Allows sending text-to-speech requests to speech-dispatcher, a common  Linux speech service. Because it&#39;s buggy, the user must explicitly  enable it so that visiting a random webpage can&#39;t cause instability.","condition":" 7 && 6","new":false},"disable-app-shims":{"original":"kDisableAppShims","comment":"Disables the creation and launch of app shims for platform apps.","condition":5,"new":false},"enable-simplified-fullscreen":{"original":"kEnableSimplifiedFullscreen","comment":"Forcibly disables Lion-style on newer OSes, to allow developers to test the  older, SnowLeopard-style fullscreen.  Enables a simplified fullscreen UI on Mac.","condition":5,"new":false},"relauncher":{"original":"kRelauncherProcess","comment":"A process type (switches::kProcessType) that relaunches the browser. See  chrome\/browser\/mac\/relauncher.h.","condition":5,"new":false},"enable-permissions-bubbles":{"original":"kEnablePermissionsBubbles","comment":"Use bubbles for content permissions requests instead of infobars.","condition":null,"new":false},"enable-cloud-print-xps":{"original":"kEnableCloudPrintXps","comment":"Fallback to XPS. By default connector uses CDD.","condition":8,"new":false},"enable-profile-shortcut-manager":{"original":"kEnableProfileShortcutManager","comment":"Force-enables the profile shortcut manager. This is needed for tests since  they use a custom-user-data-dir which disables this.","condition":8,"new":false},"force-immersive":{"original":"kForceImmersive","comment":"For the DelegateExecute verb handler to launch Chrome in metro mode on  Windows 8 and higher.  Used when relaunching metro Chrome.","condition":8,"new":false},"force-desktop":{"original":"kForceDesktop","comment":"For the DelegateExecute verb handler to launch Chrome in desktop mode on  Windows 8 and higher.  Used when relaunching metro Chrome.","condition":8,"new":false},"relaunch-shortcut":{"original":"kRelaunchShortcut","comment":"Relaunches metro Chrome on Windows 8 and higher using a given shortcut.","condition":8,"new":false},"viewer-connect":{"original":"kViewerConnect","comment":"Requests that Chrome connect to the running Metro viewer process.","condition":8,"new":false},"viewer-launch-via-appid":{"original":"kViewerLaunchViaAppId","comment":"Requests that Chrome launch the Metro viewer process via the given appid  (which is assumed to be registered as default browser) and synchronously  connect to it.","condition":8,"new":false},"wait-for-mutex":{"original":"kWaitForMutex","comment":"Waits for the given handle to be signaled before relaunching metro Chrome on  Windows 8 and higher.","condition":8,"new":false},"windows8-search":{"original":"kWindows8Search","comment":"Indicates that chrome was launched to service a search request in Windows 8.","condition":8,"new":false},"debug-print":{"original":"kDebugPrint","comment":"Enables support to debug printing subsystem.","condition":" 9 && !10","new":false},"filemgr-ext-path":{"original":"kFileManagerExtensionPath","comment":"Enables overriding the path of file manager extension.","condition":"!11","new":false},"image-loader-ext-path":{"original":"kImageLoaderExtensionPath","comment":"Enables overriding the path of image loader extension.","condition":"!11","new":false},"disable-print-preview":{"original":"kDisablePrintPreview","comment":"Controls print preview in the browser process.  Disables print preview (For testing, and for users who don&#39;t like us. :[ )","condition":12,"new":false},"enable-print-preview":{"original":"kEnablePrintPreview","comment":"Enables print preview. Chromium normally does not have the PDF viewer,  required for print preview.  pdf.dll or libpdf.so should be present in primary directory of  Chromium. For local builds it&#39;s usually out\/Debug or out\/Release.","condition":"12","new":false},"debug-on-start":{"original":"kDebugOnStart","comment":"If the program includes base\/debug\/debug_on_start_win.h, the process will  (on Windows only) start the JIT system-registered debugger on itself and  will wait for 60 seconds for the debugger to attach to itself. Then a break  point will be hit.","condition":null,"new":false},"disable-breakpad":{"original":"kDisableBreakpad","comment":"Disables the crash reporting.","condition":null,"new":false},"enable-crash-reporter":{"original":"kEnableCrashReporter","comment":"Indicates that crash reporting should be enabled. On platforms where helper  processes cannot access to files needed to make this decision, this flag is  generated internally.","condition":null,"new":false},"full-memory-crash-report":{"original":"kFullMemoryCrashReport","comment":"Generates full memory crash dump.","condition":null,"new":false},"noerrdialogs":{"original":"kNoErrorDialogs","comment":"Suppresses all error dialogs when present.","condition":null,"new":false},"test-child-process":{"original":"kTestChildProcess","comment":"When running certain tests that spawn child processes, this switch indicates  to the test framework that the current process is a child process.","condition":null,"new":false},"V: \"v\"":{"original":"kV","comment":"Gives the default maximal active V-logging level; 0 is the default.  Normally positive values are used for V-logging levels.","condition":null,"new":false},"vmodule":{"original":"kVModule","comment":"Gives the per-module maximal V-logging levels to override the value  given by --v.  E.g. \"my_module=2,foo*=3\" would change the logging  level for all code in source files \"my_module.*\" and \"foo*.*\"  (\"-inl\" suffixes are also disregarded for this matching).  Any pattern containing a forward or backward slash will be tested  against the whole pathname and not just the module.  E.g.,  \"*\/foo\/bar\/*=2\" would change the logging level for all code in  source files under a \"foo\/bar\" directory.","condition":null,"new":false},"wait-for-debugger":{"original":"kWaitForDebugger","comment":"Will wait for 60 seconds for a debugger to come to attach to the process.","condition":null,"new":false},"trace-to-console":{"original":"kTraceToConsole","comment":"Sends a pretty-printed version of tracing info to the console.","condition":null,"new":false},"profiler-timing":{"original":"kProfilerTiming","comment":"Configure whether chrome:profiler will contain timing information. This  option is enabled by default. A value of \"0\" will disable profiler timing,  while all other values will enable it.","condition":null,"new":false},"ProfilerTimingDisabledValue: \"0\"":{"original":"kProfilerTimingDisabledValue","comment":"Value of the --profiler-timing flag that will disable timing information for  chrome:profiler.","condition":null,"new":false},"disable-low-end-device-mode":{"original":"kDisableLowEndDeviceMode","comment":"Used for turning on Breakpad crash reporting in a debug environment where  crash reporting is typically compiled but disabled.  Overrides low-end device detection, disabling low-end device optimizations.","condition":0,"new":false},"enable-low-end-device-mode":{"original":"kEnableLowEndDeviceMode","comment":"Overrides low-end device detection, enabling low-end device optimizations.","condition":0,"new":false}},"constants":{"0":"OS_ANDROID","1":"OS_IOS","2":"ENABLE_PLUGIN_INSTALLATION","3":"USE_ASH","4":"OS_POSIX","5":"OS_MACOSX","6":"OS_CHROMEOS","7":"OS_LINUX","8":"OS_WIN","9":"ENABLE_FULL_PRINTING","10":"OFFICIAL_BUILD","11":"NDEBUG  ","12":"GOOGLE_CHROME_BUILD"}}